       program-id. Assignment8 as "Assignment8".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program Assignment8.
