       identification division.
       program-id. HelloWorld as "HelloWorld".

       environment division.
       configuration section.

       data division.
       working-storage section.
      
       procedure division.
           display "hi"
      

           stop run.

       end program HelloWorld.
